---
kind: property
id: P:Autodesk.Revit.DB.NurbSpline.Knots
source: html/bcb5d28e-12ab-5ea3-397d-ed5ffa8f872c.htm
---
# Autodesk.Revit.DB.NurbSpline.Knots Property

Return/set the knots of the nurb spline.

## Syntax (C#)
```csharp
public DoubleArray Knots { get; set; }
```